zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_rcc.c
  return (HAL_RCC_GetMCUFreq() >> apb2div);
}

/**
  * @brief  Returns the PCLK3 frequency
  * @note   Each time PCLK3 changes, this function must be called to update the
  *         right PCLK3 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK3 frequency
  */
uint32_t HAL_RCC_GetPCLK3Freq(void)
{
  uint32_t apb3div = 0;

  /* Compute PCLK3 frequency ---------------------------*/
  apb3div = __HAL_RCC_GET_APB3_DIV();
  if (apb3div > RCC_APB3_DIV16)
  {
    apb3div = RCC_APB3_DIV16;
  }

  return (HAL_RCC_GetMCUFreq() >> apb3div);
}

/**
  * @brief  Returns the PCLK4 frequency
  * @note   Each time PCLK4 changes, this function must be called to update the
  *         right PCLK4 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK4 frequency
  */
uint32_t HAL_RCC_GetPCLK4Freq(void)
{
  uint32_t apb4div = 0;

  /* Compute PCLK4 frequency ---------------------------*/
  apb4div = __HAL_RCC_GET_APB4_DIV();
  if (apb4div > RCC_APB4_DIV16)
  {
    apb4div = RCC_APB4_DIV16;
  }

  return (HAL_RCC_GetACLKFreq() >> apb4div);
}

/**
  * @brief  Returns the PCLK5 frequency
  * @note   Each time PCLK5 changes, this function must be called to update the
  *         right PCLK5 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK5 frequency
  */
uint32_t HAL_RCC_GetPCLK5Freq(void)
{
  uint32_t apb5div = 0;

  /* Compute PCLK5 frequency ---------------------------*/
  apb5div = __HAL_RCC_GET_APB5_DIV();
  if (apb5div > RCC_APB5_DIV16)
  {
    apb5div = RCC_APB5_DIV16;
  }

  return (HAL_RCC_GetACLKFreq() >> apb5div);
}

/**
  * @brief  Returns the ACLK frequency
  * @note   Each time ACLK changes, this function must be called to update the
  *         right ACLK value. Otherwise, any configuration based on this function will be incorrect.
  * @retval ACLK frequency
  */
uint32_t HAL_RCC_GetACLKFreq(void)
{
  uint32_t axidiv = 0;

  /* Compute ACLK frequency ---------------------------*/
  axidiv = __HAL_RCC_GET_AXI_DIV();
  if (axidiv > RCC_AXI_DIV4)
  {
    axidiv = RCC_AXI_DIV4;
  }
  axidiv += 1;

  return HAL_RCC_GetAXISSFreq() / axidiv;
}

/**
  * @brief  Returns the HCLK5 frequency
  * @note   Each time HCLK5 changes, this function must be called to update the
  *         right HCLK5 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK5 frequency
  */
uint32_t HAL_RCC_GetHCLK5Freq(void)
{
  return HAL_RCC_GetACLKFreq();
}

/**
  * @brief  Returns the HCLK6 frequency
  * @note   Each time HCLK6 changes, this function must be called to update the
  *         right HCLK6 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK6 frequency
  */
uint32_t HAL_RCC_GetHCLK6Freq(void)
{
  return HAL_RCC_GetACLKFreq();
}

/**
  * @brief  Returns the HCLK1 frequency
  * @note   Each time HCLK1 changes, this function must be called to update the
  *         right HCLK1 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK1 frequency
  */
uint32_t HAL_RCC_GetHCLK1Freq(void)
{
  return HAL_RCC_GetMCUFreq();
}

/**
  * @brief  Returns the HCLK2 frequency
  * @note   Each time HCLK1 changes, this function must be called to update the
  *         right HCLK1 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK2 frequency
  */
uint32_t HAL_RCC_GetHCLK2Freq(void)
{
  return HAL_RCC_GetMCUFreq();
}

/**
  * @brief  Returns the HCLK3 frequency
  * @note   Each time HCLK3 changes, this function must be called to update the
  *         right HCLK3 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK3 frequency
  */
uint32_t HAL_RCC_GetHCLK3Freq(void)
{
  return HAL_RCC_GetMCUFreq();
}

/**
  * @brief  Returns the HCLK4 frequency
  * @note   Each time HCLK4 changes, this function must be called to update the
  *         right HCLK4 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK4 frequency
  */
uint32_t HAL_RCC_GetHCLK4Freq(void)
{
  return HAL_RCC_GetMCUFreq();
}

/**
  * @brief  Returns the MLHCLK frequency
  * @note   Each time MLHCLK changes, this function must be called to update the
  *         right MLHCLK value. Otherwise, any configuration based on this function will be incorrect.
  * @retval HCLK4 frequency
  */
uint32_t HAL_RCC_GetMLHCLKFreq(void)
{
  return HAL_RCC_GetMCUFreq();
}


/**
  * @brief  Returns the MCU frequency
  * @note   Each time MCU changes, this function must be called to update the
  *         right MCU value. Otherwise, any configuration based on this function will be incorrect.
  * @retval MCU frequency
  */
uint32_t HAL_RCC_GetMCUFreq(void)
{
  uint32_t mcudiv = 0;

  /* Compute MCU frequency ---------------------------*/
  mcudiv = __HAL_RCC_GET_MCU_DIV();
  if (mcudiv > RCC_MCU_DIV512)
  {
    mcudiv = RCC_MCU_DIV512;
  }

  return HAL_RCC_GetMCUSSFreq() >> mcudiv;
}


/**
  * @brief  Returns the FCLK frequency
  * @note   Each time FCLK changes, this function must be called to update the
  *         right FCLK value. Otherwise, any configuration based on this function will be incorrect.
  * @retval FCLK frequency
  */
uint32_t HAL_RCC_GetFCLKFreq(void)
{
  return HAL_RCC_GetMCUFreq();
}

/**
  * @brief  Returns the CKPER frequency
  * @note   Each time CKPER changes, this function must be called to update the
  *         right CKPER value. Otherwise, any configuration based on this function will be incorrect.
  * @retval CKPER frequency
  */
uint32_t RCC_GetCKPERFreq(void)
{
  uint32_t ckperclocksource = 0, frequency = 0;

  ckperclocksource = __HAL_RCC_GET_CKPER_SOURCE();

  if (ckperclocksource == RCC_CKPERCLKSOURCE_HSI)
  {
    /* In Case the main PLL Source is HSI */
    frequency = HSI_VALUE;
  }

  else if (ckperclocksource == RCC_CKPERCLKSOURCE_CSI)
  {
    /* In Case the main PLL Source is CSI */
    frequency = CSI_VALUE;
  }

  else if (ckperclocksource == RCC_CKPERCLKSOURCE_HSE)
  {
    /* In Case the main PLL Source is HSE */
    frequency = HSE_VALUE;
  }
  else
  {
    frequency = 0;
  }

