zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_rcc.c
  return frequency;
}

/**
  * @brief  Returns the System Core frequency
  *
  * @note   The system frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constants and the selected clock source
  * @retval System Core frequency
  */
uint32_t HAL_RCC_GetSystemCoreClockFreq(void)
{
#ifdef CORE_CA7
  return HAL_RCC_GetMPUSSFreq();
#else /* CORE_CM4 */
  return HAL_RCC_GetMCUFreq();
#endif
}

uint32_t HAL_RCC_GetMPUSSFreq()
{
  uint32_t mpussfreq = 0, mpudiv = 0;
  PLL1_ClocksTypeDef pll1_clocks;

  switch (__HAL_RCC_GET_MPU_SOURCE())
  {
    case RCC_MPUSOURCE_PLL1:
      HAL_RCC_GetPLL1ClockFreq(&pll1_clocks);
      mpussfreq = pll1_clocks.PLL1_P_Frequency;
      break;

    case RCC_MPUSOURCE_MPUDIV:
      mpudiv = __HAL_RCC_GET_MPU_DIV();
      if (mpudiv == RCC_MPU_DIV_OFF)
      {
        mpussfreq = 0;
      }
      else if (mpudiv <= RCC_MPU_DIV16)
      {
        HAL_RCC_GetPLL1ClockFreq(&pll1_clocks);
        mpussfreq = (pll1_clocks.PLL1_P_Frequency >> mpudiv);
      }
      else
      {
        HAL_RCC_GetPLL1ClockFreq(&pll1_clocks);
        mpussfreq = (pll1_clocks.PLL1_P_Frequency >> 16); /* divided by 16 */
      }
      break;

    case RCC_MPUSOURCE_HSI:
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIVRDY) != 0U)
      {
        mpussfreq = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
      }
      else
      {
        mpussfreq = HSI_VALUE;
      }
      break;

    case RCC_MPUSOURCE_HSE:
      mpussfreq = HSE_VALUE;
      break;
  }

  return mpussfreq;
}


uint32_t HAL_RCC_GetAXISSFreq()
{
  uint32_t axissfreq = 0;
  PLL2_ClocksTypeDef pll2_clocks;

  switch (__HAL_RCC_GET_AXIS_SOURCE())
  {
    case RCC_AXISSOURCE_PLL2:
      HAL_RCC_GetPLL2ClockFreq(&pll2_clocks);
      axissfreq = pll2_clocks.PLL2_P_Frequency;
      break;

    case RCC_AXISSOURCE_HSI:
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIVRDY) != 0U)
      {
        axissfreq = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
      }
      else
      {
        axissfreq = HSI_VALUE;
      }
      break;

    case RCC_AXISSOURCE_HSE:
      axissfreq = HSE_VALUE;
      break;

    case RCC_AXISSOURCE_OFF:
    default:
      axissfreq = 0; /* ck_axiss is gated */
      break;
  }

  return axissfreq;
}

uint32_t HAL_RCC_GetMCUSSFreq()
{
  uint32_t mcussfreq = 0;
  PLL3_ClocksTypeDef pll3_clocks;

  switch (__HAL_RCC_GET_MCU_SOURCE())
  {
    case RCC_MCUSSOURCE_PLL3:
      HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
      mcussfreq = pll3_clocks.PLL3_P_Frequency;
      break;

    case RCC_MCUSSOURCE_HSI:
      mcussfreq = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());

      break;

    case RCC_MCUSSOURCE_HSE:
      mcussfreq = HSE_VALUE;
      break;

    case RCC_MCUSSOURCE_CSI:
      mcussfreq = CSI_VALUE;
      break;
  }

  return mcussfreq;
}



/**
  * @brief This function handles the RCC global interrupt (rcc_mcu_irq/rcc_mpu_irq)
  * @note This API should be called under the RCC_Handler().
  * @retval None
  */
void HAL_RCC_IRQHandler(void)
{
#if defined(CORE_CM4)
  uint32_t flags = (READ_REG(RCC->MC_CIFR) & RCC_IT_ALL);
#endif /* CORE_CM4 */
#if defined(CORE_CA7)
  uint32_t flags = (READ_REG(RCC->MP_CIFR) & RCC_IT_ALL);
#endif
  /* Clear the RCC interrupt bits */
  __HAL_RCC_CLEAR_IT(flags);

  if ((flags & RCC_IT_LSECSS) != RESET)
  {
    /* Enable write access to Backup domain */
    SET_BIT(PWR->CR1, PWR_CR1_DBP);

    /* Clear LSECSSON bit */
    HAL_RCCEx_DisableLSECSS();
    /* Clear LSEON bit */
    CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);
  }

  /* RCC interrupt user callback */
  HAL_RCC_Callback(flags);
}


/**
  * @brief  RCC global interrupt callback
  * @param  Flags: It contains the flags which were set during the RCC_IRQHandler
  *                before cleaning them
  * @retval None
  */
__weak void HAL_RCC_Callback(uint32_t Flags)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_Callback could be implemented in the user file
  */
}


/**
  * @brief This function handles the RCC Wake up interrupt (rcc_mcu_wkup_irq/rcc_mpu_wkup_irq)
  * @note This API should be called under the RCC_WAKEUP_Handler().
  * @retval None
  */
void HAL_RCC_WAKEUP_IRQHandler(void)
{
  /* Check RCC WKUP flag is set */
  if (__HAL_RCC_GET_IT(RCC_IT_WKUP) != RESET)
  {
    /* Clear the RCC WKUP flag bit */
    __HAL_RCC_CLEAR_IT(RCC_IT_WKUP);

    /* RCC WKUP interrupt user callback */
    HAL_RCC_WAKEUP_Callback();
  }
}


/**
  * @brief  RCC WAKEUP interrupt callback
  * @retval None
  */
__weak void HAL_RCC_WAKEUP_Callback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_WAKEUP_Callback could be implemented in the user file
  */
}


/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
